In [1]:
import numpy as np
import pandas as pd

In [2]:
# ÂºïÂÖ•Âá†‰∏™Á§∫‰æãÊï∞ÊçÆÊñπ‰æøÂ±ïÁé∞Áî®Ê≥ï
index = pd.date_range("3/29/2022", periods=8)

s = pd.Series(np.random.randn(5), index=["a", "b", "c", "d", "e"])
print(s)

df = pd.DataFrame(np.random.randn(8, 3), index=index, columns=["A", "B", "C"])
df

a    0.720661
b    0.733607
c    0.713308
d   -0.348576
e    0.313304
dtype: float64

                   A         B         C
2022-03-29 -1.038498  0.961223 -1.534477
2022-03-30  1.167511 -1.496307 -0.362229
2022-03-31  1.186557  0.755111 -2.023484
2022-04-01 -0.995277  2.530652 -1.224268
2022-04-02 -0.285570 -0.299584 -0.291299
2022-04-03 -1.294677 -0.112450 -0.110265
2022-04-04 -2.194509  1.512180  0.137462
2022-04-05 -0.222115 -1.551012 -0.303081

# head( ) Âíå tail( )
To view a small sample of a `Series` or `DataFrame` object, use the head() and tail() methods. The default number of elements to display is five, but you may pass a custom number.

In [3]:
long_series = pd.Series(np.random.randn(1000))
long_series.head()  # ÈªòËÆ§ÊòæÁ§∫Â§¥ÈÉ®‰∫î‰∏™Êï∞ÊçÆ

0   -1.393367
1    0.840800
2    0.844654
3    0.268069
4   -0.008530
dtype: float64

In [4]:
long_series.head(10)  # Ëá™ÂÆö‰πâÊòæÁ§∫Â§¥ÈÉ®ÁöÑÊï∞ÊçÆÁöÑ‰∏™Êï∞

0   -1.393367
1    0.840800
2    0.844654
3    0.268069
4   -0.008530
5    1.342263
6    0.973109
7   -1.608409
8   -2.533423
9    0.517857
dtype: float64

In [5]:
long_series.tail()  # ÈªòËÆ§ÊòæÁ§∫Â∞æÈÉ®‰∫î‰∏™Êï∞ÊçÆ

995    1.214158
996   -0.419519
997   -0.666656
998   -0.098306
999    0.256450
dtype: float64

In [6]:
long_series.tail(10)  # Ëá™ÂÆö‰πâÊòæÁ§∫Â∞æÈÉ®ÁöÑÊï∞ÊçÆÁöÑ‰∏™Êï∞

990   -0.758854
991    0.044403
992    0.333203
993    0.746683
994   -0.628298
995    1.214158
996   -0.419519
997   -0.666656
998   -0.098306
999    0.256450
dtype: float64

# attributes and underlying data  Â±ûÊÄßÂíåÂ∫ïÂ±ÇÊï∞ÊçÆ

In [7]:
df

                   A         B         C
2022-03-29 -1.038498  0.961223 -1.534477
2022-03-30  1.167511 -1.496307 -0.362229
2022-03-31  1.186557  0.755111 -2.023484
2022-04-01 -0.995277  2.530652 -1.224268
2022-04-02 -0.285570 -0.299584 -0.291299
2022-04-03 -1.294677 -0.112450 -0.110265
2022-04-04 -2.194509  1.512180  0.137462
2022-04-05 -0.222115 -1.551012 -0.303081

In [8]:
df[:3]

                   A         B         C
2022-03-29 -1.038498  0.961223 -1.534477
2022-03-30  1.167511 -1.496307 -0.362229
2022-03-31  1.186557  0.755111 -2.023484

In [9]:
df.columns = [x.lower() for x in df.columns]

In [10]:
df

                   a         b         c
2022-03-29 -1.038498  0.961223 -1.534477
2022-03-30  1.167511 -1.496307 -0.362229
2022-03-31  1.186557  0.755111 -2.023484
2022-04-01 -0.995277  2.530652 -1.224268
2022-04-02 -0.285570 -0.299584 -0.291299
2022-04-03 -1.294677 -0.112450 -0.110265
2022-04-04 -2.194509  1.512180  0.137462
2022-04-05 -0.222115 -1.551012 -0.303081

In [11]:
df.columns = [9, 'you', '88']
df

                   9       you        88
2022-03-29 -1.038498  0.961223 -1.534477
2022-03-30  1.167511 -1.496307 -0.362229
2022-03-31  1.186557  0.755111 -2.023484
2022-04-01 -0.995277  2.530652 -1.224268
2022-04-02 -0.285570 -0.299584 -0.291299
2022-04-03 -1.294677 -0.112450 -0.110265
2022-04-04 -2.194509  1.512180  0.137462
2022-04-05 -0.222115 -1.551012 -0.303081

In [12]:
s

a    0.720661
b    0.733607
c    0.713308
d   -0.348576
e    0.313304
dtype: float64

In [13]:
# Â∞Ü s ËΩ¨Êç¢‰∏∫ NumPy array
s.to_numpy()

array([ 0.72066091,  0.73360716,  0.71330845, -0.3485762 ,  0.31330419])

In [14]:
# ÊàñËÄÖ‰ΩøÁî® asarray( ) ÊñπÊ≥ï
np.asarray(s)

array([ 0.72066091,  0.73360716,  0.71330845, -0.3485762 ,  0.31330419])

In [15]:
df

                   9       you        88
2022-03-29 -1.038498  0.961223 -1.534477
2022-03-30  1.167511 -1.496307 -0.362229
2022-03-31  1.186557  0.755111 -2.023484
2022-04-01 -0.995277  2.530652 -1.224268
2022-04-02 -0.285570 -0.299584 -0.291299
2022-04-03 -1.294677 -0.112450 -0.110265
2022-04-04 -2.194509  1.512180  0.137462
2022-04-05 -0.222115 -1.551012 -0.303081

In [16]:
# When your DataFrame only has a single data type for all the columns, DataFrame.to_numpy() will return the underlying data.
# Â∞Ü df ËΩ¨Êç¢‰∏∫ NumPy array
df.to_numpy()

array([[-1.03849839,  0.96122344, -1.53447693],
       [ 1.16751134, -1.49630705, -0.36222885],
       [ 1.18655719,  0.75511054, -2.02348431],
       [-0.99527732,  2.53065186, -1.22426849],
       [-0.28556984, -0.29958408, -0.29129887],
       [-1.29467667, -0.11245043, -0.1102651 ],
       [-2.19450877,  1.51218045,  0.13746157],
       [-0.22211516, -1.55101155, -0.303081  ]])

# matching / broadcasting behavior   ÂåπÈÖçË°å‰∏∫ / ÂπøÊí≠Ë°å‰∏∫

In [17]:
df = pd.DataFrame(
    {
        "one": pd.Series(np.arange(3, 6), index=["a", "b", "c"]),
        "two": pd.Series(np.arange(7, 11), index=["a", "b", "c", "d"]),
        "three": pd.Series(np.arange(3), index=["b", "c", "d"]),
    }
)

df

   one  two  three
a  3.0    7    NaN
b  4.0    8    0.0
c  5.0    9    1.0
d  NaN   10    2.0

In [18]:
selected_row = df.iloc[1]
print(selected_row)

print('-'*30)

selected_column = df["two"]
print(selected_column)

one      4.0
two      8.0
three    0.0
Name: b, dtype: float64
------------------------------
a     7
b     8
c     9
d    10
Name: two, dtype: int32

### [üßê***ÂèÇËÄÉÂçöÂÆ¢***](https://blog.csdn.net/wyf2017/article/details/107459509)
---
![](https://img-blog.csdnimg.cn/20200720111708736.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9ibG9nLmNzZG4ubmV0L3d5ZjIwMTc=,size_16,color_FFFFFF,t_70)

In [19]:
#  Á¨¨‰∏ÄÂàóÁöÑÁ¨¨‰∏Ä‰∏™„ÄÅÁ¨¨‰∫åÂàóÁöÑÁ¨¨‰∏Ä‰∏™„ÄÅÁ¨¨‰∏âÂàóÁöÑÁ¨¨‰∏Ä‰∏™     ÂéªÂáè    selected_row
#  Á¨¨‰∏ÄÂàóÁöÑÁ¨¨‰∫å‰∏™„ÄÅÁ¨¨‰∫åÂàóÁöÑÁ¨¨‰∫å‰∏™„ÄÅÁ¨¨‰∏âÂàóÁöÑÁ¨¨‰∫å‰∏™     ÂéªÂáè    selected_row
#  Á¨¨‰∏ÄÂàóÁöÑÁ¨¨‰∏â‰∏™„ÄÅÁ¨¨‰∫åÂàóÁöÑÁ¨¨‰∏â‰∏™„ÄÅÁ¨¨‰∏âÂàóÁöÑÁ¨¨‰∏â‰∏™     ÂéªÂáè    selected_row
df.sub(selected_row, axis="columns")

   one  two  three
a -1.0 -1.0    NaN
b  0.0  0.0    0.0
c  1.0  1.0    1.0
d  NaN  2.0    2.0

In [20]:
df.sub(selected_row, axis=1)

   one  two  three
a -1.0 -1.0    NaN
b  0.0  0.0    0.0
c  1.0  1.0    1.0
d  NaN  2.0    2.0

In [21]:
#  Á¨¨‰∏ÄË°åÁöÑÁ¨¨‰∏Ä‰∏™„ÄÅÁ¨¨‰∫åË°åÁöÑÁ¨¨‰∏Ä‰∏™„ÄÅÁ¨¨‰∏âË°åÁöÑÁ¨¨‰∏Ä‰∏™     ÂéªÂáè    selected_column
#  Á¨¨‰∏ÄË°åÁöÑÁ¨¨‰∫å‰∏™„ÄÅÁ¨¨‰∫åË°åÁöÑÁ¨¨‰∫å‰∏™„ÄÅÁ¨¨‰∏âË°åÁöÑÁ¨¨‰∫å‰∏™     ÂéªÂáè    selected_column
#  Á¨¨‰∏ÄË°åÁöÑÁ¨¨‰∏â‰∏™„ÄÅÁ¨¨‰∫åË°åÁöÑÁ¨¨‰∏â‰∏™„ÄÅÁ¨¨‰∏âË°åÁöÑÁ¨¨‰∏â‰∏™     ÂéªÂáè    selected_column
df.sub(selected_column, axis="index")

   one  two  three
a -4.0    0    NaN
b -4.0    0   -8.0
c -4.0    0   -8.0
d  NaN    0   -8.0

In [22]:
df.sub(selected_column, axis=0)

   one  two  three
a -4.0    0    NaN
b -4.0    0   -8.0
c -4.0    0   -8.0
d  NaN    0   -8.0

# Comparing if objects are equivalent

In [23]:
df1 = pd.DataFrame({"col": ["foo", 0, np.nan]})
df1

   col
0  foo
1    0
2  NaN

In [24]:
df2 = pd.DataFrame({"col": [np.nan, 0, "foo"]}, index=[2, 1, 0])
df2

   col
2  NaN
1    0
0  foo

#### üò¥Note that the Series or DataFrame index needs to be in the same order for equality to be True:

In [25]:
df1.equals(df2)

False

In [26]:
df2.sort_index()

   col
0  foo
1    0
2  NaN

In [27]:
df1.equals(df2.sort_index())

True

# Index of min/max values
The idxmin() and idxmax() functions on Series and DataFrame compute the index labels with the minimum and maximum corresponding values.

In [28]:
s1 = pd.Series([2, 6, 8, -3, -10])
s1.dtype

dtype('int64')

In [29]:
s1.idxmin()

4

In [30]:
s1.idxmax()

2

In [31]:
df1 = pd.DataFrame([[2, -3, 8, 4], [9, 30, -100, 35], [23, 43, -33, -66], [423, 9, -3, -88]], columns=['you', 'and', 'me', 'forever'])
df1

   you  and   me  forever
0    2   -3    8        4
1    9   30 -100       35
2   23   43  -33      -66
3  423    9   -3      -88

In [32]:
df1.idxmin(axis='index')

you        0
and        0
me         1
forever    3
dtype: int64

In [33]:
df1.idxmin(axis=0)

you        0
and        0
me         1
forever    3
dtype: int64

In [34]:
df1.idxmax(axis='columns')

0         me
1    forever
2        and
3        you
dtype: object

In [35]:
df1.idxmax(axis=1)

0         me
1    forever
2        and
3        you
dtype: object

# Mixed dtypes &nbsp;&nbsp;&nbsp;Ê∑∑ÂêàÊï∞ÊçÆÁ±ªÂûã

In [36]:
mdf = pd.DataFrame(
    {
        "A": [1, 2, 3],
        "B": [1.0, 2.0, 3.0],
        "C": ["foo", "bar", "baz"],
        "D": pd.date_range("20130101", periods=3),
    }
)

mdf

   A    B    C          D
0  1  1.0  foo 2013-01-01
1  2  2.0  bar 2013-01-02
2  3  3.0  baz 2013-01-03

In [37]:
mdf.dtypes

A             int64
B           float64
C            object
D    datetime64[ns]
dtype: object

In [38]:
mdf.agg(["min", "sum"])

     A    B          C          D
min  1  1.0        bar 2013-01-01
sum  6  6.0  foobarbaz        NaT

# Transform API

In [39]:
tsdf = pd.DataFrame(
    np.random.randint(-30, 20, size=(10, 3)),
    columns=["A", "B", "C"],
    index=pd.date_range("3/30/2022", periods=10),
)
tsdf

             A   B   C
2022-03-30   8 -16 -14
2022-03-31 -25  13   3
2022-04-01 -25  11 -12
2022-04-02 -25  -5  14
2022-04-03   3   3 -30
2022-04-04 -19  10  17
2022-04-05  -7   9  17
2022-04-06 -25   6  14
2022-04-07 -24  10  -1
2022-04-08   1 -13 -30

In [40]:
tsdf.iloc[3]

A   -25
B    -5
C    14
Name: 2022-04-02 00:00:00, dtype: int32

In [41]:
tsdf.iloc[3:7]

             A   B   C
2022-04-02 -25  -5  14
2022-04-03   3   3 -30
2022-04-04 -19  10  17
2022-04-05  -7   9  17

In [42]:
tsdf[3:7]

             A   B   C
2022-04-02 -25  -5  14
2022-04-03   3   3 -30
2022-04-04 -19  10  17
2022-04-05  -7   9  17

In [43]:
tsdf.loc['2022-04-01']

A   -25
B    11
C   -12
Name: 2022-04-01 00:00:00, dtype: int32

In [44]:
tsdf[3:7] = np.nan
tsdf

               A     B     C
2022-03-30   8.0 -16.0 -14.0
2022-03-31 -25.0  13.0   3.0
2022-04-01 -25.0  11.0 -12.0
2022-04-02   NaN   NaN   NaN
2022-04-03   NaN   NaN   NaN
2022-04-04   NaN   NaN   NaN
2022-04-05   NaN   NaN   NaN
2022-04-06 -25.0   6.0  14.0
2022-04-07 -24.0  10.0  -1.0
2022-04-08   1.0 -13.0 -30.0

#### üòéTransform the entire frame. .transform() allows input functions as: a NumPy function, a string function name or a user defined function.

In [45]:
tsdf.transform(np.abs)

               A     B     C
2022-03-30   8.0  16.0  14.0
2022-03-31  25.0  13.0   3.0
2022-04-01  25.0  11.0  12.0
2022-04-02   NaN   NaN   NaN
2022-04-03   NaN   NaN   NaN
2022-04-04   NaN   NaN   NaN
2022-04-05   NaN   NaN   NaN
2022-04-06  25.0   6.0  14.0
2022-04-07  24.0  10.0   1.0
2022-04-08   1.0  13.0  30.0

In [46]:
tsdf.transform('abs')

               A     B     C
2022-03-30   8.0  16.0  14.0
2022-03-31  25.0  13.0   3.0
2022-04-01  25.0  11.0  12.0
2022-04-02   NaN   NaN   NaN
2022-04-03   NaN   NaN   NaN
2022-04-04   NaN   NaN   NaN
2022-04-05   NaN   NaN   NaN
2022-04-06  25.0   6.0  14.0
2022-04-07  24.0  10.0   1.0
2022-04-08   1.0  13.0  30.0

In [47]:
tsdf.transform(lambda x: abs(x))

               A     B     C
2022-03-30   8.0  16.0  14.0
2022-03-31  25.0  13.0   3.0
2022-04-01  25.0  11.0  12.0
2022-04-02   NaN   NaN   NaN
2022-04-03   NaN   NaN   NaN
2022-04-04   NaN   NaN   NaN
2022-04-05   NaN   NaN   NaN
2022-04-06  25.0   6.0  14.0
2022-04-07  24.0  10.0   1.0
2022-04-08   1.0  13.0  30.0

In [48]:
np.abs(tsdf)

               A     B     C
2022-03-30   8.0  16.0  14.0
2022-03-31  25.0  13.0   3.0
2022-04-01  25.0  11.0  12.0
2022-04-02   NaN   NaN   NaN
2022-04-03   NaN   NaN   NaN
2022-04-04   NaN   NaN   NaN
2022-04-05   NaN   NaN   NaN
2022-04-06  25.0   6.0  14.0
2022-04-07  24.0  10.0   1.0
2022-04-08   1.0  13.0  30.0

In [49]:
tsdf["A"].transform('abs')

2022-03-30     8.0
2022-03-31    25.0
2022-04-01    25.0
2022-04-02     NaN
2022-04-03     NaN
2022-04-04     NaN
2022-04-05     NaN
2022-04-06    25.0
2022-04-07    24.0
2022-04-08     1.0
Freq: D, Name: A, dtype: float64

## Transform with multiple functions
Passing multiple functions will yield a column MultiIndexed DataFrame. The first level will be the original frame column names; the second level will be the names of the transforming functions.

In [50]:
tsdf.transform([np.abs, lambda x: x + 1000])

                  A                 B                 C
           absolute <lambda> absolute <lambda> absolute <lambda>
2022-03-30      8.0   1008.0     16.0    984.0     14.0    986.0
2022-03-31     25.0    975.0     13.0   1013.0      3.0   1003.0
2022-04-01     25.0    975.0     11.0   1011.0     12.0    988.0
2022-04-02      NaN      NaN      NaN      NaN      NaN      NaN
2022-04-03      NaN      NaN      NaN      NaN      NaN      NaN
2022-04-04      NaN      NaN      NaN      NaN      NaN      NaN
2022-04-05      NaN      NaN      NaN      NaN      NaN      NaN
2022-04-06     25.0    975.0      6.0   1006.0     14.0   1014.0
2022-04-07     24.0    976.0     10.0   1010.0      1.0    999.0
2022-04-08      1.0   1001.0     13.0    987.0     30.0    970.0

In [51]:
tsdf.transform([np.abs, lambda x: x + 1000]).columns

MultiIndex([('A', 'absolute'),
            ('A', '<lambda>'),
            ('B', 'absolute'),
            ('B', '<lambda>'),
            ('C', 'absolute'),
            ('C', '<lambda>')],
           )

Passing multiple functions to a Series will yield a DataFrame. The resulting column names will be the transforming functions.

In [52]:
tsdf["A"].transform([np.abs, lambda x: x + 1])

            absolute  <lambda>
2022-03-30       8.0       9.0
2022-03-31      25.0     -24.0
2022-04-01      25.0     -24.0
2022-04-02       NaN       NaN
2022-04-03       NaN       NaN
2022-04-04       NaN       NaN
2022-04-05       NaN       NaN
2022-04-06      25.0     -24.0
2022-04-07      24.0     -23.0
2022-04-08       1.0       2.0

In [53]:
tsdf["A"].transform([np.abs, lambda x: x + 1]).columns

Index(['absolute', '<lambda>'], dtype='object')

# reindexing and altering labels ÈáçÊñ∞Á¥¢ÂºïÂíåÊõ¥ÊîπÊ†áÁ≠æ

In [54]:
s1 = pd.Series(np.random.randint(-8, 20, size=5), index=['a', 'b', 'c', 'd', 'e'])
s1

a    14
b    -2
c    18
d     5
e    -3
dtype: int32

In [55]:
s1.reindex(['c', 'e', 'a', 'you', 'a', 'me', 'hahaha'])

c         18.0
e         -3.0
a         14.0
you        NaN
a         14.0
me         NaN
hahaha     NaN
dtype: float64

In [56]:
df1 = pd.DataFrame(np.random.randint(-8, 100, size=(4, 3)), index=['a', 'b', 'c', 'd'], columns=['one', 'two', 'three'])
df1

   one  two  three
a   43   69     36
b   93   77     92
c   93   10     75
d    8   83     66

In [57]:
df1.reindex(index=['b', 'd', 'you', 'a'])

      one   two  three
b    93.0  77.0   92.0
d     8.0  83.0   66.0
you   NaN   NaN    NaN
a    43.0  69.0   36.0

In [58]:
df1.reindex(['b', 'd', 'you', 'a'], axis='index')  # axis=0 ÊòØ‰∏ÄÊ†∑ÁöÑ

      one   two  three
b    93.0  77.0   92.0
d     8.0  83.0   66.0
you   NaN   NaN    NaN
a    43.0  69.0   36.0

In [59]:
df1.reindex(columns=['two', 'happy', 'one', 'together'])

   two  happy  one  together
a   69    NaN   43       NaN
b   77    NaN   93       NaN
c   10    NaN   93       NaN
d   83    NaN    8       NaN

In [60]:
df1.reindex(['two', 'happy', 'one', 'together'], axis='columns')  # axis=1 ÊòØ‰∏ÄÊ†∑ÁöÑ

   two  happy  one  together
a   69    NaN   43       NaN
b   77    NaN   93       NaN
c   10    NaN   93       NaN
d   83    NaN    8       NaN

In [61]:
df1.reindex(index=['b', 'd', 'you', 'a'], columns=['two', 'happy', 'one', 'together'])  # index „ÄÅcolumns ÂêåÊó∂ÈáçÊñ∞Á¥¢Âºï

      two  happy   one  together
b    77.0    NaN  93.0       NaN
d    83.0    NaN   8.0       NaN
you   NaN    NaN   NaN       NaN
a    69.0    NaN  43.0       NaN

In [62]:
index_share1 = s1.reindex(df1.index)  # df1 ÁöÑ index ‰∏é s1 ÁöÑindex ÊúâÈáçÂè†ÔºåÊâÄ‰ª•ÂèØ‰ª•ÂÖ±‰∫´~
index_share1

a    14
b    -2
c    18
d     5
dtype: int32

In [63]:
index_share1.index is df1.index

True

In [64]:
index_share2 = df1.reindex(s1.index, axis=0)
index_share2

    one   two  three
a  43.0  69.0   36.0
b  93.0  77.0   92.0
c  93.0  10.0   75.0
d   8.0  83.0   66.0
e   NaN   NaN    NaN

In [65]:
index_share2.index is s1.index

True

In [66]:
df = pd.DataFrame(np.random.randint(-10, 100, size=(3, 2)), index=['b', 'd', 'a'], columns=['three', 'two'])
df

   three  two
b     66   30
d     61   67
a     66   42

In [67]:
df1

   one  two  three
a   43   69     36
b   93   77     92
c   93   10     75
d    8   83     66

In [68]:
# reindex_like( ) ÊñπÊ≥ï
df1.reindex_like(df)

   three  two
b     92   77
d     66   83
a     36   69

# aligning objects with each other with align( )

In [69]:
s = pd.Series(np.random.randint(1, 50, size=5), index=['a', 'b', 'c', 'd', 'e'])
s

a    49
b    22
c     1
d     1
e     2
dtype: int32

In [70]:
s1 = s[:4]
s1

a    49
b    22
c     1
d     1
dtype: int32

In [71]:
s2 = s[2:]
s2

c    1
d    1
e    2
dtype: int32

In [72]:
s1.align(s2)  # ÂÆÉËøîÂõû‰∏Ä‰∏™ÂåÖÂê´‰∏§‰∏™ÈáçÊñ∞Á¥¢ÂºïSeriesÁöÑÂÖÉÁªÑ „ÄÇÈªòËÆ§ÈááÁî®Á¥¢ÂºïÁöÑÂπ∂ÈõÜÔºåÂç≥ join='outer'

(a    49.0
 b    22.0
 c     1.0
 d     1.0
 e     NaN
 dtype: float64,
 a    NaN
 b    NaN
 c    1.0
 d    1.0
 e    2.0
 dtype: float64)

In [73]:
s1.align(s2, join='left')  # join='left': use the calling object‚Äôs index

(a    49
 b    22
 c     1
 d     1
 dtype: int32,
 a    NaN
 b    NaN
 c    1.0
 d    1.0
 dtype: float64)

In [74]:
s1.align(s2, join='right')  # join='right': use the passed object‚Äôs index

(c    1.0
 d    1.0
 e    NaN
 dtype: float64,
 c    1
 d    1
 e    2
 dtype: int32)

In [75]:
s1.align(s2, join='inner')  # join='inner': intersect the indexes

(c    1
 d    1
 dtype: int32,
 c    1
 d    1
 dtype: int32)

# filling while reindexing

In [76]:
rng = pd.date_range("30/3/2022", periods=8)
rng

DatetimeIndex(['2022-03-30', '2022-03-31', '2022-04-01', '2022-04-02',
               '2022-04-03', '2022-04-04', '2022-04-05', '2022-04-06'],
              dtype='datetime64[ns]', freq='D')

In [77]:
ts = pd.Series(np.random.randint(10, 100, size=8), index=rng)
ts

2022-03-30    98
2022-03-31    78
2022-04-01    38
2022-04-02    17
2022-04-03    41
2022-04-04    81
2022-04-05    89
2022-04-06    42
Freq: D, dtype: int32

In [78]:
ts2 = ts[[1, 3, 6]]
ts2

2022-03-31    78
2022-04-02    17
2022-04-05    89
dtype: int32

In [79]:
ts2.reindex(ts.index)

2022-03-30     NaN
2022-03-31    78.0
2022-04-01     NaN
2022-04-02    17.0
2022-04-03     NaN
2022-04-04     NaN
2022-04-05    89.0
2022-04-06     NaN
Freq: D, dtype: float64

In [80]:
ts2.reindex(ts.index, method='ffill')  # ÂêëÂâçÂ°´ÂÖÖÂÄº

2022-03-30     NaN
2022-03-31    78.0
2022-04-01    78.0
2022-04-02    17.0
2022-04-03    17.0
2022-04-04    17.0
2022-04-05    89.0
2022-04-06    89.0
Freq: D, dtype: float64

In [81]:
ts2.reindex(ts.index, method='bfill')  # ÂêëÂêéÂ°´ÂÖÖÂÄº

2022-03-30    78.0
2022-03-31    78.0
2022-04-01    17.0
2022-04-02    17.0
2022-04-03    89.0
2022-04-04    89.0
2022-04-05    89.0
2022-04-06     NaN
Freq: D, dtype: float64

In [82]:
ts2.reindex(ts.index, method='nearest')  # ‰ªéÊúÄËøëÁöÑÁ¥¢ÂºïÂÄºÂ°´ÂÖÖ

2022-03-30    78
2022-03-31    78
2022-04-01    17
2022-04-02    17
2022-04-03    17
2022-04-04    89
2022-04-05    89
2022-04-06    89
Freq: D, dtype: int32

These methods require that the indexes are ordered increasing or decreasing.

Note that the same result could have been achieved using fillna (except for method='nearest') or interpolate.

reindex() will raise a ValueError if the index is not monotonically increasing or decreasing. fillna() and interpolate() will not perform any checks on the order of the index.

# dropping labels from an axis

In [83]:
df1

   one  two  three
a   43   69     36
b   93   77     92
c   93   10     75
d    8   83     66

In [84]:
df1.drop(['a', 'd'], axis=0)

   one  two  three
b   93   77     92
c   93   10     75

In [85]:
df1.drop(['one', 'two'], axis=1)

   three
a     36
b     92
c     75
d     66

# renaming / mapping labels
The rename() method allows you to relabel an axis based on some mapping (a dict or Series) or an arbitrary function.

In [86]:
s1

a    49
b    22
c     1
d     1
dtype: int32

In [87]:
s1.rename(str.upper)

A    49
B    22
C     1
D     1
dtype: int32

In [88]:
s1.name

In [89]:
# https://blog.csdn.net/cuihuijun1hao/article/details/78155216
s1.rename("you", inplace=True)  # SeriesÁöÑ name Â±ûÊÄßÔºåÂú®ÊääËØ•SeriesËΩ¨‰∏∫DataFrameÊó∂ÔºåÂèØ‰ª•‰Ωú‰∏∫ columns ÁöÑÊ†áÁ≠æÂêç

a    49
b    22
c     1
d     1
Name: you, dtype: int32

In [90]:
pd.DataFrame(s1)

   you
a   49
b   22
c    1
d    1

**-----------------------------------------------------------------------------------------------------------------------------------------------------**

In [91]:
df

   three  two
b     66   30
d     61   67
a     66   42

In [92]:
df.rename(
    columns={"three": "foo", "two": "bar"},
    index={"a": "apple"},  # ÊÉ≥‰øÆÊîπÂá†‰∏™Â∞±‰øÆÊîπÂá†‰∏™
)

       foo  bar
b       66   30
d       61   67
apple   66   42

In [93]:
df

   three  two
b     66   30
d     61   67
a     66   42

In [94]:
# DataFrame.rename() also supports an ‚Äúaxis-style‚Äù calling convention, 
# where you specify a single mapper and the axis to apply that mapping to.
df.rename({"three": "foo", "two": "bar"}, axis=1)  # ÊàñËÄÖ axis='columns'

   foo  bar
b   66   30
d   61   67
a   66   42

In [95]:
df.rename({'d': 888888888888}, axis=0)  # ÊÉ≥‰øÆÊîπÂá†‰∏™Â∞±‰øÆÊîπÂá†‰∏™ÔºÅÔºÅÔºÅ

              three  two
b                66   30
888888888888     61   67
a                66   42

In [96]:
# The rename() method also provides an inplace named parameter that is by default False and copies the underlying data. 
# Pass inplace=True to rename the data in place.  
df.rename({'d': 888888888888}, axis=0, inplace=True)

In [97]:
df  # ÂèëÁé∞ df Ë¢´‰øÆÊîπ‰∫Ü

              three  two
b                66   30
888888888888     61   67
a                66   42

---

# iteration Ëø≠‰ª£

## In short, basic iteration (`for i in object`) produces:
- **Series**: values
- **DataFrame**: column labels

In [98]:
# ÂØπ‰∫é SeriesÔºå ÊâìÂç∞ÂÄº
s1

a    49
b    22
c     1
d     1
Name: you, dtype: int32

In [99]:
for value in s1:
    print(value)

49
22
1
1

In [100]:
# ÂØπ‰∫éDataFrameÔºåÊâìÂç∞ÂàóÊ†áÁ≠æ
df1

   one  two  three
a   43   69     36
b   93   77     92
c   93   10     75
d    8   83     66

In [101]:
for col in df1:
    print(col)

one
two
three

In [102]:
df1

   one  two  three
a   43   69     36
b   93   77     92
c   93   10     75
d    8   83     66

In [103]:
for (key, value) in df1.items():
    print(key, value, sep='\n')

one
a    43
b    93
c    93
d     8
Name: one, dtype: int32
two
a    69
b    77
c    10
d    83
Name: two, dtype: int32
three
a    36
b    92
c    75
d    66
Name: three, dtype: int32

**To iterate over the rows of a DataFrame, you can use the following methods:**

- iterrows(): Iterate over the rows of a DataFrame as (index, Series) pairs. This converts the rows to Series objects, which can change the dtypes and has some performance implications.

- itertuples(): Iterate over the rows of a DataFrame as namedtuples of the values. This is a lot faster than iterrows(), and is in most cases preferable to use to iterate over the values of a DataFrame.

In [104]:
df1

   one  two  three
a   43   69     36
b   93   77     92
c   93   10     75
d    8   83     66

In [105]:
for value in df1.itertuples():
    print(value, sep='\n')

Pandas(Index='a', one=43, two=69, three=36)
Pandas(Index='b', one=93, two=77, three=92)
Pandas(Index='c', one=93, two=10, three=75)
Pandas(Index='d', one=8, two=83, three=66)

In [106]:
for row_index, row in df1.iterrows():
    print(row_index, '\n', row, '\n')

a
 one      43
two      69
three    36
Name: a, dtype: int32

b
 one      93
two      77
three    92
Name: b, dtype: int32

c
 one      93
two      10
three    75
Name: c, dtype: int32

d
 one       8
two      83
three    66
Name: d, dtype: int32

In [107]:
df1

   one  two  three
a   43   69     36
b   93   77     92
c   93   10     75
d    8   83     66

In [108]:
# You should never modify something you are iterating over. 
# This is not guaranteed to work in all cases. 
# Depending on the data types, the iterator returns a copy and not a view, and writing to it will have no effect! 
for index, row in df1.iterrows():
    row[0] = 10

In [109]:
df1

   one  two  three
a   10   69     36
b   10   77     92
c   10   10     75
d   10   83     66